# Pandas Tutorial

In [16]:
import pandas as pd

print(pd.__version__)

2.0.3

# Series create, manipulate, delete , query

In [17]:
# creating a series from list

arr = [0,1,2,3,4]
s1 = pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [18]:
order = [1,2,3,4,5]
s2 = pd.Series(arr, index = order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [19]:
import numpy as np

n = np.random.randn(5)
index = ["a","b","c","d","e"]
s2 = pd.Series(n, index = index)
s2

a    1.323142
b    0.597188
c    0.148003
d   -0.267090
e   -1.631447
dtype: float64

In [20]:
# create seres from dictionaries

In [21]:
d = {"a":1,"b":2,"c":3,"d":4,"e":5}
s3 = pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [22]:
# modefy index of series

In [23]:
print(s1)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [24]:
s1.index = ["A","B","C","D","E"]
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [25]:
# Slicing

In [26]:
s1[:3]
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [27]:
s1[:-1]
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [28]:
s4 = s1.append(s3)
s3

AttributeError: 'Series' object has no attribute 'append'

In [29]:
s4.drop("e")
s4

NameError: name 's4' is not defined

In [30]:
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [31]:
s2

a    1.323142
b    0.597188
c    0.148003
d   -0.267090
e   -1.631447
dtype: float64

In [32]:
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [33]:
s4

NameError: name 's4' is not defined

In [34]:
s3.drop("a")

b    2
c    3
d    4
e    5
dtype: int64

In [35]:
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

# series operations

In [36]:
arr1 = [0,1,2,3,4,5,6,7]
arr2 = [6,7,8,9,5]

In [37]:
s5 = pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [38]:
s6 = pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int64

In [39]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
7     NaN
dtype: float64

In [40]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
7    NaN
dtype: float64

In [41]:
s5.multiply(s6)

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
7     NaN
dtype: float64

In [42]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
7     NaN
dtype: float64

In [43]:
s6.median()

3.5

In [44]:
s6.max()

7

In [45]:
s6.min()

0

# Create DataFrame

In [46]:
dates = pd.date_range("today", periods= 6) # Define time sequence as numbers
num_arr = np.random.randn(6,4)  #import numpy random
columns = ["A","B","C","D"]
df1 = pd.DataFrame(num_arr,index = dates, columns = columns)
df1

                                   A         B         C         D
2023-11-08 11:02:16.948843  1.488079 -0.217268  0.840142  0.999239
2023-11-09 11:02:16.948843 -0.163754  0.113297  0.204844  1.379061
2023-11-10 11:02:16.948843 -1.429687  1.151725  0.885368  0.069774
2023-11-11 11:02:16.948843 -0.130042  0.511847 -0.495191 -0.736433
2023-11-12 11:02:16.948843 -1.007745  1.254950  1.527375 -1.533688
2023-11-13 11:02:16.948843 -0.926883 -0.411163 -0.242782  0.009112

In [47]:
# create datafarme with dictionary array

In [48]:
dog = {"Animal": ["cat","dog","snake","mouse","lion","zarafee"],
       "Age": [23,1,2,55.6,4,7],
       "Visits": [3,5,3,2,7,1],
        "Priority": ["yes","no","yes","no","yes","no"]}
lables = ["a","b","c","d","e","f"]

df2 = pd.DataFrame(dog, index=lables)
df2

    Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   7.0       1       no

In [49]:
df2.dtypes

Animal       object
Age         float64
Visits        int64
Priority     object
dtype: object

In [50]:
df2.head

<bound method NDFrame.head of     Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   7.0       1       no>

In [51]:
df2.tail

<bound method NDFrame.tail of     Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   7.0       1       no>

In [52]:
df2.head(6)

    Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   7.0       1       no

In [53]:
df2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [54]:
print(df2.index)
df2.columns

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

Index(['Animal', 'Age', 'Visits', 'Priority'], dtype='object')

In [55]:
df2.values

array([['cat', 23.0, 3, 'yes'],
       ['dog', 1.0, 5, 'no'],
       ['snake', 2.0, 3, 'yes'],
       ['mouse', 55.6, 2, 'no'],
       ['lion', 4.0, 7, 'yes'],
       ['zarafee', 7.0, 1, 'no']], dtype=object)

In [56]:
df2.describe()

             Age    Visits
count   6.000000  6.000000
mean   15.433333  3.500000
std    21.266092  2.167948
min     1.000000  1.000000
25%     2.500000  2.250000
50%     5.500000  3.000000
75%    19.000000  4.500000
max    55.600000  7.000000

In [57]:
df2.T

             a    b      c      d     e        f
Animal     cat  dog  snake  mouse  lion  zarafee
Age       23.0  1.0    2.0   55.6   4.0      7.0
Visits       3    5      3      2     7        1
Priority   yes   no    yes     no   yes       no

In [58]:
df2.sort_values(by="Age")

    Animal   Age  Visits Priority
b      dog   1.0       5       no
c    snake   2.0       3      yes
e     lion   4.0       7      yes
f  zarafee   7.0       1       no
a      cat  23.0       3      yes
d    mouse  55.6       2       no

In [59]:
# slicing dataframe

In [60]:
df2[1:3]

  Animal  Age  Visits Priority
b    dog  1.0       5       no
c  snake  2.0       3      yes

In [61]:
df2.sort_values(by="Age")[1:3]

  Animal  Age  Visits Priority
c  snake  2.0       3      yes
e   lion  4.0       7      yes

In [62]:
# query dataframe by tag

In [63]:
df2[["Age","Visits"]]

    Age  Visits
a  23.0       3
b   1.0       5
c   2.0       3
d  55.6       2
e   4.0       7
f   7.0       1

In [64]:
# copy

df3 = df2.copy()
df3

    Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   7.0       1       no

In [65]:
df3.isnull()

   Animal    Age  Visits  Priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False  False   False     False
e   False  False   False     False
f   False  False   False     False

In [66]:
df3.loc["f","Age"] = 1.5
df3

    Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   1.5       1       no

In [67]:
df3.mean()

TypeError: Could not convert ['catdogsnakemouselionzarafee' 'yesnoyesnoyesno'] to numeric

In [ ]:
df3.mean()

In [ ]:
df3["Visits"].sum()

In [ ]:
df3["Visits"].min()

In [ ]:
df3["Visits"].max()

In [ ]:
df3.sum()

In [68]:
string = pd.Series(["cat","mouse","cow","dog","horse","elepahnt",np.nan,"A","B","C"])
string.str.lower()

0         cat
1       mouse
2         cow
3         dog
4       horse
5    elepahnt
6         NaN
7           a
8           b
9           c
dtype: object

In [69]:
string = pd.Series(["cat","mouse","cow","dog","horse","elepahnt",np.nan,"A","B","C"])
string.str.upper()

0         CAT
1       MOUSE
2         COW
3         DOG
4       HORSE
5    ELEPAHNT
6         NaN
7           A
8           B
9           C
dtype: object

# Operations for DataFrame missing values

In [70]:
df4 = df3.copy()
df4

    Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   1.5       1       no

In [71]:
df4 = df3.copy()
df4.fillna(4)

    Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   1.5       1       no

In [73]:
#drop misssing data
df5 = df3.copy()
df5.dropna(how="any")
df5

    Animal   Age  Visits Priority
a      cat  23.0       3      yes
b      dog   1.0       5       no
c    snake   2.0       3      yes
d    mouse  55.6       2       no
e     lion   4.0       7      yes
f  zarafee   1.5       1       no

# DataFrame File Operations

In [78]:
df3.to_csv("animal.csv") # it will save the csv file in the drectory wheren jupyter is installed or we can use full directory her

In [77]:
df_animal =pd.read_csv("animal.csv")
df_animal.head(3)

  Unnamed: 0 Animal   Age  Visits Priority
0          a    cat  23.0       3      yes
1          b    dog   1.0       5       no
2          c  snake   2.0       3      yes

In [79]:
df3.to_excel("animal.xlsx", sheet_name = "Sheet1") # export it to excel

In [80]:
df_animal2 = pd.read_excel("animal.xlsx", "Sheet1", index_col = None, na_values =["NA"])  # read exel file
df_animal2

  Unnamed: 0   Animal   Age  Visits Priority
0          a      cat  23.0       3      yes
1          b      dog   1.0       5       no
2          c    snake   2.0       3      yes
3          d    mouse  55.6       2       no
4          e     lion   4.0       7      yes
5          f  zarafee   1.5       1       no